# -*- encoding: utf-8 -*-

from indicnlp.tokenize import sentence_tokenize
from indicnlp.tokenize import indic_tokenize

import stanza


te_text = "పరీక్షిత్తు మహారాజులా తాను కూడా ఏడు రోజులపాటు భాగవతం విని మోక్షం పొందాలనుకున్నాడో రాజు. పండితుణ్ణి పిలిచి భాగవతం చదివించుకుని విన్నాడు. వారం గడిచినా.. ఇంకా తనకు మోక్షం ఎందుకు సిద్ధించలేదని అడిగాడు. ఆ మాటలు విన్న పండితుడు- ‘రాజా! నా పని భాగవతాన్ని వినిపించడం వరకే. మోక్షం ఇప్పిస్తానని నేను చెప్పలేదు కదా! అయితే మీ ప్రశ్నకు మా గురువు సరైన సమాధానం ఇవ్వగలరు. ఆయన్ని పిలిపించండి’ అన్నాడు. గురువు వచ్చాడు. పండితుణ్ణి అడిగిన ప్రశ్నే అతణ్ణీ అడిగాడు రాజు. ‘ఒక్క పావుగంట పాటు నన్ను ఈ రాజ్యానికి రాజును చేస్తే.. మీ సందేహం తీరుస్తాను మహారాజా’ అన్నాడతను. అలాగేనన్నాడు రాజు. గురువు సింహాసనం అధిరోహించగానే.. పండితుణ్ణి, రాజునూ ఇద్దరినీ బంధించమన్నాడు. కొన్ని నిమిషాల తర్వాత గురువు పండితుడి వంక చూసి ‘రాజును బంధ విముక్తుణ్ణి చెయ్యి’ అన్నాడు. దానికి పండితుడు ‘నా కట్లు విప్పకుండా నేనెలా విడిపించగలను?’ అన్నాడు. ‘రాజా! ఇప్పుడు మీ సందేహం తీరిందా? బందీ అయిన వ్యక్తి మరొకరి బంధనాలను తొలగించలేనట్లే.. ముక్తుడు కాని వ్యక్తి మరొకరికి ముక్తి కలిగించలేడు. శుకమహర్షి వంటి యోగి లభించి, పరీక్షిత్తు అంతటి శ్రద్ధాసక్తులు ఉన్నప్పుడే మోక్షం సిద్ధిస్తుంది. అంటే బోధించే గురువు మహాజ్ఞాని అయ్యుండాలి. అలాగే అది వినే వ్యక్తికి అర్థం చేసుకునే గొప్ప విజ్ఞత ఉండాలి’ అంటూ వివరించాడు గురువు. మోక్షసిద్ధి గురించి ఒక శిష్యుడు అడిగిన ప్రశ్నకు రామకృష్ణ పరమహంస చెప్పిన కథ ఇది."


stanza_telugu_nlp = stanza.Pipeline(
    "te",
    processors="tokenize,pos,lemma",
    download_method=stanza.DownloadMethod.REUSE_RESOURCES,
    tagset="universal",
)
stanza_te_text_doc = stanza_telugu_nlp(te_text)

stanza_sentences = [sent.text for sent in stanza_te_text_doc.sentences]
stanza_word_tokens = []
for sent in stanza_te_text_doc.sentences:
    for word in sent.words:
        stanza_word_tokens.append(word.text)

print("\n\n")
print("====================================")
print("Using stanza:")

print("\n\n")
print("\nSentences:\n")
for sentence in stanza_sentences:
    print(sentence)

"""

Sentences:

పరీక్షిత్తు మహారాజులా తాను కూడా ఏడు రోజులపాటు భాగవతం విని మోక్షం పొందాలనుకున్నాడో రాజు.
పండితుణ్ణి పిలిచి భాగవతం చదివించుకుని విన్నాడు.
వారం గడిచినా..
ఇంకా తనకు మోక్షం ఎందుకు సిద్ధించలేదని అడిగాడు.
ఆ మాటలు విన్న పండితుడు- ‘రాజా!
నా పని భాగవతాన్ని వినిపించడం వరకే.
మోక్షం ఇప్పిస్తానని నేను చెప్పలేదు కదా!
అయితే మీ ప్రశ్నకు మా గురువు సరైన సమాధానం ఇవ్వగలరు.
ఆయన్ని పిలిపించండి’ అన్నాడు.
గురువు వచ్చాడు.
పండితుణ్ణి అడిగిన ప్రశ్నే అతణ్ణీ అడిగాడు రాజు.
‘ఒక్క పావుగంట పాటు నన్ను ఈ రాజ్యానికి రాజును చేస్తే..
మీ సందేహం తీరుస్తాను మహారాజా’ అన్నాడతను.
అలాగేనన్నాడు రాజు.
గురువు సింహాసనం అధిరోహించగానే..
పండితుణ్ణి, రాజునూ ఇద్దరినీ బంధించమన్నాడు.
కొన్ని నిమిషాల తర్వాత గురువు పండితుడి వంక చూసి ‘రాజును బంధ విముక్తుణ్ణి చెయ్యి’ అన్నాడు.
దానికి పండితుడు ‘నా కట్లు విప్పకుండా నేనెలా విడిపించగలను?’ అన్నాడు.
‘రాజా!
ఇప్పుడు మీ సందేహం తీరిందా?
బందీ అయిన వ్యక్తి మరొకరి బంధనాలను తొలగించలేనట్లే..
ముక్తుడు కాని వ్యక్తి మరొకరికి ముక్తి కలిగించలేడు.
శుకమహర్షి వంటి యోగి లభించి, పరీక్షిత్తు అంతటి శ్రద్ధాసక్తులు ఉన్నప్పుడే మోక్షం సిద్ధిస్తుంది.
అంటే బోధించే గురువు మహాజ్ఞాని అయ్యుండాలి.
అలాగే అది వినే వ్యక్తికి అర్థం చేసుకునే గొప్ప విజ్ఞత ఉండాలి’
అంటూ వివరించాడు గురువు.
మోక్షసిద్ధి గురించి ఒక శిష్యుడు అడిగిన ప్రశ్నకు రామకృష్ణ పరమహంస చెప్పిన కథ ఇది.
"""

print("\n\n")
print("Word tokens:")
for word in stanza_word_tokens:
    print(word)

print("====================================")
print("\n\n")

indicnlp_sentences = sentence_tokenize.sentence_split(te_text, lang='te')
indicnlp_word_tokens = indic_tokenize.trivial_tokenize(te_text)

print("\n\n")
print("====================================")
print("\n\nUsing indicnlp:\n")

print("\n\nSentences:\n")
for sentence in indicnlp_sentences:
    print(sentence)

"""
Sentences:

పరీక్షిత్తు మహారాజులా తాను కూడా ఏడు రోజులపాటు భాగవతం విని మోక్షం పొందాలనుకున్నాడో రాజు.
పండితుణ్ణి పిలిచి భాగవతం చదివించుకుని విన్నాడు.
వారం గడిచినా. . ఇంకా తనకు మోక్షం ఎందుకు సిద్ధించలేదని అడిగాడు.
ఆ మాటలు విన్న పండితుడు- ‘రాజా!
నా పని భాగవతాన్ని వినిపించడం వరకే.
మోక్షం ఇప్పిస్తానని నేను చెప్పలేదు కదా!
అయితే మీ ప్రశ్నకు మా గురువు సరైన సమాధానం ఇవ్వగలరు.
ఆయన్ని పిలిపించండి’ అన్నాడు.
గురువు వచ్చాడు.
పండితుణ్ణి అడిగిన ప్రశ్నే అతణ్ణీ అడిగాడు రాజు.
‘ఒక్క పావుగంట పాటు నన్ను ఈ రాజ్యానికి రాజును చేస్తే. . మీ సందేహం తీరుస్తాను మహారాజా’ అన్నాడతను.
అలాగేనన్నాడు రాజు.
గురువు సింహాసనం అధిరోహించగానే. . పండితుణ్ణి, రాజునూ ఇద్దరినీ బంధించమన్నాడు.
కొన్ని నిమిషాల తర్వాత గురువు పండితుడి వంక చూసి ‘రాజును బంధ విముక్తుణ్ణి చెయ్యి’ అన్నాడు.
దానికి పండితుడు ‘నా కట్లు విప్పకుండా నేనెలా విడిపించగలను?
’ అన్నాడు.
‘రాజా!
ఇప్పుడు మీ సందేహం తీరిందా?
బందీ అయిన వ్యక్తి మరొకరి బంధనాలను తొలగించలేనట్లే. . ముక్తుడు కాని వ్యక్తి మరొకరికి ముక్తి కలిగించలేడు.
శుకమహర్షి వంటి యోగి లభించి, పరీక్షిత్తు అంతటి శ్రద్ధాసక్తులు ఉన్నప్పుడే మోక్షం సిద్ధిస్తుంది.
అంటే బోధించే గురువు మహాజ్ఞాని అయ్యుండాలి.
అలాగే అది వినే వ్యక్తికి అర్థం చేసుకునే గొప్ప విజ్ఞత ఉండాలి’ అంటూ వివరించాడు గురువు.
మోక్షసిద్ధి గురించి ఒక శిష్యుడు అడిగిన ప్రశ్నకు రామకృష్ణ పరమహంస చెప్పిన కథ ఇది.
"""

print("\n\nWord tokens:\n")
for word in indicnlp_word_tokens:
    print(word)

print("====================================")
print("\n\n")
